<?php session_start();
 ?>
 <!DOCTYPE html>
 <html lang="ru">
 <head>
   <meta charset="utf-8">
   <meta name="viewport" content="width=device-width, initial scale=1.0">
   <meta http-equiv="X-UA-Compatible" content="ie=edge">
   <link rel="stylesheet" href="./css/style.css">
   <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css">
   <title> Якутские наcтольные игры</title>
 </head>
 <body>

   <?php require "../blocks/header.php"?>

   <div class="box">
    <img src="../img/nastol.jpeg" width="1481" height="700">
   </div>

   <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
       <h1>Хабылык</h1>
       <p class="font-weight-normal">Хабылык (или лучинки) – древнейшая игра, развивающая воображение, навыки счета, быстрого соображения.
        Играют с помощью деревянных лучинок (палочек), которые использовались для разжигания очага дома. Сначала лучинками игрались дети,
        потом постепенно игра перешла и ко взрослым, которые написали правила. Лошади испокон веков считались священными
        созданиями, и потому в игре «Хабылык» лучинки олицетворяют лошадей.</p><p class="text-break">
        Их 30, длиной 20 см, толщиной 0,5 см, шириной 1 см – простые и с метками, указывающие на возраст лошадок.
        Например, жеребенок имеет одну метку полоской, двухлетка две полоски, трехлетка - три, четырехлетка - четыре, пятилетка – пять,
        жеребец – шесть меток. Исчисляется в единицах простых палок. Так один жеребец равен количеству в 5 простых палок.
        Играть могут сколько угодно человек. Первый игрок в одну ладонь помещает (берет) все палочки, подбрасывает их на высоту
        примерно 15 сантиметров. Тыльной стороной нужно подставить ладонь и «поймать» лучинки. Затем идет второе подкидывание
        уже с ловлей самой ладонью. Оставшиеся в руках палочки называют коровами. Далее нужно разделяя по два стопку лучинок
        продолжать подбрасывать как раньше. Когда в итоге останется одна палочка, участник забирает ее себе и продолжает подкидывать.
        Нужно стараться ловить главные фигуры, так как он забирает столько «коров», сколько стоит эта фигура. Ход переходит к
        другому игроку в том случае, если игрок поймает четное количество «коров». Главные фигуры начинают ловить тогда,
        когда «коровы» закончатся. 5 главных палочек ловят комбинацией среднего и безымянного пальцев. После начинается
        подсчитывание количества «коров».</p><p class="text-break">«Тойоном» (Вожаком) становится тот, у кого больше всех «коров». Проигравший должен
        сидеть под столом, пока вожак не постучит по столу 3 раза. «Тойон» (Вожак) по какой-нибудь причине может не постучать
        по столу, тогда проигравший сидит под столом на протяжении следующей игры.
</p>
<div class="box">
 <img src="../img/habylyk.jpeg" width="200" height="200">
 <img src="../img/habylyk2.jpeg" width="200" height="200">
 <img src="../img/habylyk3.jpeg" width="200" height="200">
</div>
     </main>

     <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
         <h1>Хаамыска</h1>
         <p class="font-weight-normal">
           Хаамыска (дословный перевод, камешки, с якутского) - национальная настольная игра,
           ориентированная на развитие мелкой моторики, ловкости и па-мяти.
           Для игры требуется 5 кубиков, чаще всего, изготовленных из дерева, со стандартным размером стороны 15мм.
           Игра проводится за столом или ровной горизонтальной поверхностью, количество играющих – не ограничено.
           Игра начинается с подбрасывания вверх всех пяти кубиков одним игроком, тот игрок,
           который поймал кубик с отметкой начинает игру. </p><p class="text-break">
           Игра хаамыска состоит из шести этапов. До четвертого этапа участник каждый раз рассыпает хаамыска
           на столе перед собой и берет одну из них.
            1 этап: Подбрасывая вверх ее, участник должен во время ее полета успеть подобрать со стола по одной
            хаамыска и поймать подброшенную.
            2 этап: Подбрасывая вверх одну хаамыска, участник поднимает каждый раз по две и ловит подброшенную.
            3 этап: Подбрасывая вверх одну хаамыска, участник поднимает со стола вначале одну, затем — остальные три или наоборот.
            4 этап: Подкидывая одну, участник во время ее полета должен положить на стол остальные четыре.
            Снова подкидывает одну и во время ее полета должен успеть подобрать все четыре и поймать подброшенную.
            5 этап: Игрок бросает на стол все хаамыска. Берет одну и, подкидывая ее вверх, собирает в ладонь остальные по одной.
            6 этап: Все хаамыска участник держит в ладони, подбрасывает все и ловит их тыльной стороной ладони,
            снова подбрасывает и ловит все камешки с прихватом упавших на стол при первом подбрасывании.</p><p class="text-break">
            Игрок, сделавший всю последовательность без ошибок (ошибкой считается нарушение
            последовательности и падение подброшенных кубиков на стол) считается победителем.
          </p>
          <div class="box">
           <img src="../img/kamush.jpeg" width="200" height="200">
           <img src="../img/kamush2.jpeg" width="200" height="200">
           <img src="../img/kamush3.jpeg" width="200" height="200">
          </div>
       </main>
       <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
           <h1>Тырыынка</h1>
           <p class="font-weight-normal">
            Тырыынка развивает ловкость рук и внимательность, играется теми же лучинками, что и в игре «Хабылык».</p><p class="text-break">
            Участник держит палки-тырыынка вертикально и резко отпускает, образуя ими кучу.
            Задача состоит в том, чтобы собрать как можно больше свободно лежащих палочек-тырыынка
            специальной ложкой не задев ни одной палки. При малейшем содрогании лежащих в куче лучинок,
            партия текущего участника заканчивается, а оставшиеся палочки дают следующему игроку.
            Когда все палочки разобраны, остается посчитать количество у отдельных игроков.</p><p class="text-break">
            Побеждает тот, у кого больше всего набранных единиц игры.
            </p>
            <div class="box">
             <img src="../img/tyrynka.jpeg" width="200" height="200">
             <img src="../img/tyrynka2.jpeg" width="200" height="200">
             <img src="../img/tyrynka3.jpeg" width="200" height="200">
            </div>
         </main>
         <main class="bg-warning px-3 text-center w-100 h-100 p-5 mx-auto flex-column border-top ">
             <h1>Магазин</h1>
             <h5 class="font-weight-normal">
             В нашем магазине можно приобрести набор якутских настольных игр.</h5><h5 class="text-break">
             Чтобы оформить заказ, нажмите заказать.</h5><h5 class="text-break">
             Товары продаются на территории города Якутска, получение - самовывозом.
            </h5>
           </main>
<?php
$mysql = new mysqli('localhost','root','','mydb');
$result = $mysql->query("SELECT * FROM `products`");
$counter= 0;
 while($row = $result->fetch_assoc()){
$counter=$counter+1;
  ?>
    <div class="d-flex flex-row gap-3 w-50 p-3">
    <div class="">
       <p>Название товара: </p><?= $row['title'] ?>
    </div>
    <div class="">
       <p>Цена: </p> <?= $row['price'] ?>
    </div>
    <div class="">
     <p>Описание: </p>  <?= $row['description'] ?>
    </div>
      <?php
      $mysql1 = new mysqli('localhost','root','','mydb');
      $images = $mysql1->query("SELECT * FROM `products_image` WHERE `product_id` = $counter");
      while($imagerow = $images->fetch_assoc()){
        ?>  <img class="bg-warning img-thumbnail w-50 rounded float-left" src="../img/<?=$imagerow['image']?>" alt="t"> <?php
      }
      ?>
    </div>
  <?php
}
 ?>

 <div class="text-center">
   <p>Чтобы сделать заказ, войдите в личный кабинет или создайте его.</p>
   <form action="../zakaz.php" method="post" class="mx-3">
     <button type="submit" class="btn btn-success">Заказать</button>
   </form>
 </div>

   <?php require "../blocks/footer.php"?>
 </body>
</html>
