<?php session_start();
 ?>
 <!DOCTYPE html>
 <html lang="ru">
 <head>
   <meta charset="utf-8">
   <meta name="viewport" content="width=device-width, initial scale=1.0">
   <meta http-equiv="X-UA-Compatible" content="ie=edge">
   <link rel="stylesheet" href="./css/style.css">
   <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css">
   <title> Якутские подвижные игры</title>
 </head>
 <body>

   <?php require "../blocks/header.php"?>

   <div class="box">
    <img src="../img/pgames.jpg" width="1481" height="700">
   </div>

   <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
       <h1>Подними хворую корову</h1>
       <p class="font-weight-normal">
         Весной корова была довольно ослабшей и захворавшей после холодной и долгой якутской зимы.
         Она не могла даже встать. На помощь приходили хозяева и пытались поднять уставшую коровку.
         Отсюда и пошла такая веселая игра «хворая корова».</p><p class="text-break">
        Можно играть командами. Игрок садится на землю, обхватив ступню правой ноги, а левая нога прямая -
        это начальное положение. Задача участника встать на левую ногу, не разжимая рук.
        Техника такова, что нужно пинаться изо всех сил правой ногой.</p><p class="text-break">
          Есть три попытки, чтобы встать, иначе игрок получает звание «хворая корова».
        </p>
     </main>

     <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
         <h1>Водопой</h1>
         <p class="font-weight-normal">
          Данная игра так же связана со скотом, так как народ Саха - издавна занимаются скотоводством.
          Зимой скотоводы водили своих коров к проруби на водопой. Таким образом образовалась игра,
          повторяющая движения животных, стремящихся выпить воду из проруби.</p><p class="text-break">
          Суть игры заключается в том, чтобы держа левое ухо правой рукой и правую ногу левой рукой достать
          стаканчик с водой и выпить его. Правила: нельзя отпускать ногу или ухо, емкость с водой должна быть высотой с кулак.</p><p class="text-break">
          Игра считается пройденной, если участник выпьет воду не теряя равновесие и не отпуская рук.
          </p>
       </main>

       <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
           <h1>Прыжки крестом</h1>
           <p class="font-weight-normal">
          Понадобятся две палки (ширина - 3 см; диаметр - 70 см; толщина - 5 мм).
          Палки лежат над землей крестиком в виде буквы «Х».</p><p class="text-break">
          Задача участника - петь песню и одновременно прыгать на одной ноге
          между этими палками и не задеть их. Руки находятся за спиной.
          Игра считается оконченной, если участник коснется креста.</p><p class="text-break">
          А побеждает тот игрок, который смог продержаться так 1 минуту.
            </p>
         </main>

         <main class="px-3 text-center w-100 h-100 p-5 mx-auto flex-column">
             <h1>Тутум эргиир</h1>
             <p class="font-weight-normal">
               Народ Саха с древности требовала от себя хорошую физическую подготовку,
               так как основная деятельность Саха была охота. Чтобы стать сильнее и выносливее,
               было придумано упражение «Тутум эргиир». Тутум эргиир – является тренировочным упражнением,
               развивающей у человека координацию, гибкость и силовую выносливость.
               Также предупреждает от травматизма спины.</p><p class="text-break">
            Для данного комплексного упражнения требуется минимум спортивного инвентаря
            в виде деревянных палки и опоры с углублением под палку.
            Длина палки составляет 36-50 см, палка обхватывается спортсменом снизу одной рукой на растоянии 8-10 см от низа,
            а сверху второй рукой. Далее один конец палки вставляется в углубление в опоре и спортсменом
            выполняются обороты вокруг себя. Опора имеет 8 углублений разной высоты и сложности,
            самый легкий уровень имеет высоту 110 см, а самая сложная высота опоры – в пол.
            </p><p class="text-break">
              Основная задача для спортсмена – обернуться вокруг себя как можно больше,
              при этом не касаясь пола и не выпуская из рук палку. Необходимо выполнить упражнение
              после хорошей разминки тела.
              </p>
           </main>
   <?php require "../blocks/footer.php"?>

 </body>
</html>
